app/views/classrooms/_form.html.erb

    <%= f.label :campus_id %><br>
    <%= f.collection_select :campus_id, Campus.order(:name).uniq,:id,:name  %>
---
SELECT DISTINCT "campuses".* FROM "campuses"   ORDER BY "campuses"."name" ASC