app/views/enrolls/_form.html.erb

    <%= f.label :course_id %><br>
    <%= f.collection_select :course_id, Course.order(:name).uniq,:id,:name %>
---
SELECT DISTINCT "courses".* FROM "courses"   ORDER BY "courses"."name" ASC

    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id, User.order(:first_name).uniq,:id,:first_name %>
---
SELECT DISTINCT "users".* FROM "users"   ORDER BY "users"."first_name" ASC