app/views/bookings/_form.html.erb

    <%= f.label :course_id %><br>
    <%=  f.collection_select :course_id, Course.order(:name).uniq,:id,:name  %>
---
SELECT DISTINCT "courses".* FROM "courses"   ORDER BY "courses"."name" ASC

    <%= f.label :classroom_id %><br>
    <%=  f.collection_select :classroom_id, Classroom.order(:room_name).uniq,:id,:room_name  %>
---
SELECT DISTINCT "classrooms".* FROM "classrooms"   ORDER BY "classrooms"."room_name" ASC