app/views/campuses/show.html.erb

<strong> Classrooms: </strong>
<% @campus.classrooms.each do |classroom| %>
---
SELECT "classrooms".* FROM "classrooms"  WHERE "classrooms"."campus_id" = $1  [["campus_id", 1]]