app/views/courses/show.html.erb

<p><strong>Students on this course:</strong>
<% @course.enrolls.each do |enroll| %>
<li><%= link_to enroll.user.first_name, enroll %></li>
---
SELECT "enrolls".* FROM "enrolls"  WHERE "enrolls"."course_id" = $1  [["course_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 106  ORDER BY "users"."id" ASC LIMIT 1

<p><strong>Instructors on this course:</strong>
<% @course.instructs.each do |user_id| %>
---
SELECT "instructs".* FROM "instructs"  WHERE "instructs"."course_id" = $1  [["course_id", 1]]