app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("classroom_id", "course_id", "created_at", "date", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["classroom_id", 1], ["course_id", 1], ["created_at", "2014-12-16 15:04:41.113163"], ["date", "2014-11-18"], ["updated_at", "2014-12-16 15:04:41.113163"]]
---
  def create
    @booking = Booking.new(booking_params)
    @booking.save