app/controllers/campuses_controller.rb

SELECT "campuses".* FROM "campuses"
---
  def index
    @campuses = Campus.all

INSERT INTO "campuses" ("campus_image", "created_at", "description", "location", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["campus_image", "images"], ["created_at", "2014-12-16 16:13:24.120156"], ["description", "sdf"], ["location", "sfd"], ["name", "sdf"], ["updated_at", "2014-12-16 16:13:24.120156"]]
---
  def create
    @campus = Campus.new(campus_params)
    @campus.save

UPDATE "campuses" SET "image" = $1, "updated_at" = $2 WHERE "campuses"."id" = 1  [["image", "https://pbs.twimg.com/media/B2oQ1X5IAAEdyxY.jpg:large"], ["updated_at", "2014-12-16 13:30:57.734446"]]
---
  def update
    @campus.update(campus_params)

DELETE FROM "campuses" WHERE "campuses"."id" = $1  [["id", 3]]
---
  def destroy
    @campus.destroy

SELECT  "campuses".* FROM "campuses"  WHERE "campuses"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_campus
      @campus = Campus.find(params[:id])