app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def create
    @classroom = Classroom.new(classroom_params)
    @classroom.save
---
INSERT INTO "classrooms" ("campus_id", "capacity", "created_at", "room_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["campus_id", 1], ["capacity", 15], ["created_at", "2014-12-16 15:43:57.087012"], ["room_name", "Classroom 2"], ["updated_at", "2014-12-16 15:43:57.087012"]]

  def update
    @classroom.update(classroom_params)
---
UPDATE "classrooms" SET "room_name" = $1, "updated_at" = $2 WHERE "classrooms"."id" = 1  [["room_name", "Classroom 1"], ["updated_at", "2014-12-16 15:44:24.943816"]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms"  WHERE "classrooms"."id" = $1 LIMIT 1  [["id", 1]]