app/controllers/courses_controller.rb

UPDATE "courses" SET "end_date" = $1, "price" = $2, "start_date" = $3, "updated_at" = $4 WHERE "courses"."id" = 1  [["end_date", "2015-02-17"], ["price", 8000], ["start_date", "2014-11-17"], ["updated_at", "2014-12-16 13:08:45.195801"]]
---
  def update
    @course.update(course_params)