app/controllers/enrolls_controller.rb

SELECT "enrolls".* FROM "enrolls"
---
  def index
    @enrolls = Enroll.all

INSERT INTO "enrolls" ("course_id", "created_at", "payment_status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_id", 1], ["created_at", "2014-12-16 14:16:12.828997"], ["payment_status", "Paid"], ["updated_at", "2014-12-16 14:16:12.828997"], ["user_id", 106]]
---
  def create
    @enroll = Enroll.new(enroll_params)
    @enroll.save

UPDATE "enrolls" SET "payment_status" = $1, "updated_at" = $2 WHERE "enrolls"."id" = 6  [["payment_status", "Half paid"], ["updated_at", "2014-12-17 09:27:48.389515"]]
---
  def update
    @enroll.update(enroll_params)

DELETE FROM "enrolls" WHERE "enrolls"."id" = $1  [["id", 7]]
---
  def destroy
    @enroll.destroy

SELECT  "enrolls".* FROM "enrolls"  WHERE "enrolls"."id" = $1 LIMIT 1  [["id", 7]]
---
    def set_enroll
      @enroll = Enroll.find(params[:id])