app/controllers/instructs_controller.rb

  def index
    @instructs = Instruct.all
---
SELECT "instructs".* FROM "instructs"

  def create
    @instruct = Instruct.new(instruct_params)
    @instruct.save
---
INSERT INTO "instructs" ("course_id", "created_at", "level", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_id", 1], ["created_at", "2014-12-16 15:25:29.478228"], ["level", "Teaching assistant "], ["updated_at", "2014-12-16 15:25:29.478228"], ["user_id", 124]]

  def update
    @instruct.update(instruct_params)
---
UPDATE "instructs" SET "course_id" = $1, "level" = $2, "updated_at" = $3, "user_id" = $4 WHERE "instructs"."id" = 2  [["course_id", 1], ["level", "Lead Instructor"], ["updated_at", "2014-12-17 10:20:23.074332"], ["user_id", 122]]

    def set_instruct
      @instruct = Instruct.find(params[:id])
---
SELECT  "instructs".* FROM "instructs"  WHERE "instructs"."id" = $1 LIMIT 1  [["id", 1]]