app/controllers/users_controller.rb

  def index
    @q = User.search(params[:q])
---
SELECT "users".* FROM "users"