app/controllers/user_controller.rb

SELECT "users".* FROM "users"
---
   def index
     @q = User.search(params[:q])